Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1170/periph/PERI_SRC.h
/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- SRC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SRC_Peripheral_Access_Layer SRC Peripheral Access Layer
 * @{
 */

/** SRC - Size of Registers Arrays */
#define SRC_GPR_COUNT                             20u

/** SRC - Register Layout Typedef */
typedef struct {
  __IO uint32_t SCR;                               /**< SRC Control Register, offset: 0x0 */
  __IO uint32_t SRMR;                              /**< SRC Reset Mode Register, offset: 0x4 */
  __I  uint32_t SBMR1;                             /**< SRC Boot Mode Register 1, offset: 0x8 */
  __I  uint32_t SBMR2;                             /**< SRC Boot Mode Register 2, offset: 0xC */
  __IO uint32_t SRSR;                              /**< SRC Reset Status Register, offset: 0x10 */
  __IO uint32_t GPR[SRC_GPR_COUNT];                /**< SRC General Purpose Register, array offset: 0x14, array step: 0x4 */
       uint8_t RESERVED_0[412];
  __IO uint32_t AUTHEN_MEGA;                       /**< Slice Authentication Register, offset: 0x200 */
  __IO uint32_t CTRL_MEGA;                         /**< Slice Control Register, offset: 0x204 */
  __IO uint32_t SETPOINT_MEGA;                     /**< Slice Setpoint Config Register, offset: 0x208 */
  __IO uint32_t DOMAIN_MEGA;                       /**< Slice Domain Config Register, offset: 0x20C */
  __IO uint32_t STAT_MEGA;                         /**< Slice Status Register, offset: 0x210 */
       uint8_t RESERVED_1[12];
  __IO uint32_t AUTHEN_DISPLAY;                    /**< Slice Authentication Register, offset: 0x220 */
  __IO uint32_t CTRL_DISPLAY;                      /**< Slice Control Register, offset: 0x224 */
  __IO uint32_t SETPOINT_DISPLAY;                  /**< Slice Setpoint Config Register, offset: 0x228 */
  __IO uint32_t DOMAIN_DISPLAY;                    /**< Slice Domain Config Register, offset: 0x22C */
  __IO uint32_t STAT_DISPLAY;                      /**< Slice Status Register, offset: 0x230 */
       uint8_t RESERVED_2[12];
  __IO uint32_t AUTHEN_WAKEUP;                     /**< Slice Authentication Register, offset: 0x240 */
  __IO uint32_t CTRL_WAKEUP;                       /**< Slice Control Register, offset: 0x244 */
  __IO uint32_t SETPOINT_WAKEUP;                   /**< Slice Setpoint Config Register, offset: 0x248 */
  __IO uint32_t DOMAIN_WAKEUP;                     /**< Slice Domain Config Register, offset: 0x24C */
  __IO uint32_t STAT_WAKEUP;                       /**< Slice Status Register, offset: 0x250 */
       uint8_t RESERVED_3[44];
  __IO uint32_t AUTHEN_M4CORE;                     /**< Slice Authentication Register, offset: 0x280 */
  __IO uint32_t CTRL_M4CORE;                       /**< Slice Control Register, offset: 0x284 */
  __IO uint32_t SETPOINT_M4CORE;                   /**< Slice Setpoint Config Register, offset: 0x288 */
  __IO uint32_t DOMAIN_M4CORE;                     /**< Slice Domain Config Register, offset: 0x28C */
  __IO uint32_t STAT_M4CORE;                       /**< Slice Status Register, offset: 0x290 */
       uint8_t RESERVED_4[12];
  __IO uint32_t AUTHEN_M7CORE;                     /**< Slice Authentication Register, offset: 0x2A0 */
  __IO uint32_t CTRL_M7CORE;                       /**< Slice Control Register, offset: 0x2A4 */
  __IO uint32_t SETPOINT_M7CORE;                   /**< Slice Setpoint Config Register, offset: 0x2A8 */
  __IO uint32_t DOMAIN_M7CORE;                     /**< Slice Domain Config Register, offset: 0x2AC */
  __IO uint32_t STAT_M7CORE;                       /**< Slice Status Register, offset: 0x2B0 */
       uint8_t RESERVED_5[12];
  __IO uint32_t AUTHEN_M4DEBUG;                    /**< Slice Authentication Register, offset: 0x2C0 */
  __IO uint32_t CTRL_M4DEBUG;                      /**< Slice Control Register, offset: 0x2C4 */
  __IO uint32_t SETPOINT_M4DEBUG;                  /**< Slice Setpoint Config Register, offset: 0x2C8 */
  __IO uint32_t DOMAIN_M4DEBUG;                    /**< Slice Domain Config Register, offset: 0x2CC */
  __IO uint32_t STAT_M4DEBUG;                      /**< Slice Status Register, offset: 0x2D0 */
       uint8_t RESERVED_6[12];
  __IO uint32_t AUTHEN_M7DEBUG;                    /**< Slice Authentication Register, offset: 0x2E0 */
  __IO uint32_t CTRL_M7DEBUG;                      /**< Slice Control Register, offset: 0x2E4 */
  __IO uint32_t SETPOINT_M7DEBUG;                  /**< Slice Setpoint Config Register, offset: 0x2E8 */
  __IO uint32_t DOMAIN_M7DEBUG;                    /**< Slice Domain Config Register, offset: 0x2EC */
  __IO uint32_t STAT_M7DEBUG;                      /**< Slice Status Register, offset: 0x2F0 */
       uint8_t RESERVED_7[12];
  __IO uint32_t AUTHEN_USBPHY1;                    /**< Slice Authentication Register, offset: 0x300 */
  __IO uint32_t CTRL_USBPHY1;                      /**< Slice Control Register, offset: 0x304 */
  __IO uint32_t SETPOINT_USBPHY1;                  /**< Slice Setpoint Config Register, offset: 0x308 */
  __IO uint32_t DOMAIN_USBPHY1;                    /**< Slice Domain Config Register, offset: 0x30C */
  __IO uint32_t STAT_USBPHY1;                      /**< Slice Status Register, offset: 0x310 */
       uint8_t RESERVED_8[12];
  __IO uint32_t AUTHEN_USBPHY2;                    /**< Slice Authentication Register, offset: 0x320 */
  __IO uint32_t CTRL_USBPHY2;                      /**< Slice Control Register, offset: 0x324 */
  __IO uint32_t SETPOINT_USBPHY2;                  /**< Slice Setpoint Config Register, offset: 0x328 */
  __IO uint32_t DOMAIN_USBPHY2;                    /**< Slice Domain Config Register, offset: 0x32C */
  __IO uint32_t STAT_USBPHY2;                      /**< Slice Status Register, offset: 0x330 */
} SRC_Type;

/* ----------------------------------------------------------------------------
   -- SRC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SRC_Register_Masks SRC Register Masks
 * @{
 */

/*! @name SCR - SRC Control Register */
/*! @{ */

#define SRC_SCR_BT_RELEASE_M4_MASK               (0x1U)
#define SRC_SCR_BT_RELEASE_M4_SHIFT              (0U)
/*! BT_RELEASE_M4
 *  0b0..cm4 core reset is asserted
 *  0b1..cm4 core reset is released
 */
#define SRC_SCR_BT_RELEASE_M4(x)                 (((uint32_t)(((uint32_t)(x)) << SRC_SCR_BT_RELEASE_M4_SHIFT)) & SRC_SCR_BT_RELEASE_M4_MASK)

