Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1170/periph/PERI_SRC.h
#define SRC_SRSR_TEMPSENSE_RST_B_M7_MASK         (0x400U)
#define SRC_SRSR_TEMPSENSE_RST_B_M7_SHIFT        (10U)
/*! TEMPSENSE_RST_B_M7
 *  0b0..Reset is not a result of software reset from Temperature Sensor.
 *  0b1..Reset is a result of software reset from Temperature Sensor.
 */
#define SRC_SRSR_TEMPSENSE_RST_B_M7(x)           (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_TEMPSENSE_RST_B_M7_SHIFT)) & SRC_SRSR_TEMPSENSE_RST_B_M7_MASK)

#define SRC_SRSR_M4_REQUEST_M7_MASK              (0x800U)
#define SRC_SRSR_M4_REQUEST_M7_SHIFT             (11U)
/*! M4_REQUEST_M7
 *  0b0..Reset is not a result of m4 reset request.
 *  0b1..Reset is a result of m4 reset request.
 */
#define SRC_SRSR_M4_REQUEST_M7(x)                (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_M4_REQUEST_M7_SHIFT)) & SRC_SRSR_M4_REQUEST_M7_MASK)

#define SRC_SRSR_M4_LOCKUP_M7_MASK               (0x1000U)
#define SRC_SRSR_M4_LOCKUP_M7_SHIFT              (12U)
/*! M4_LOCKUP_M7
 *  0b0..Reset is not a result of the mentioned case.
 *  0b1..Reset is a result of the mentioned case.
 */
#define SRC_SRSR_M4_LOCKUP_M7(x)                 (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_M4_LOCKUP_M7_SHIFT)) & SRC_SRSR_M4_LOCKUP_M7_MASK)

#define SRC_SRSR_OVERVOLT_RST_M7_MASK            (0x2000U)
#define SRC_SRSR_OVERVOLT_RST_M7_SHIFT           (13U)
/*! OVERVOLT_RST_M7
 *  0b0..Reset is not a result of the mentioned case.
 *  0b1..Reset is a result of the mentioned case.
 */
#define SRC_SRSR_OVERVOLT_RST_M7(x)              (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_OVERVOLT_RST_M7_SHIFT)) & SRC_SRSR_OVERVOLT_RST_M7_MASK)

#define SRC_SRSR_CDOG_RST_M7_MASK                (0x4000U)
#define SRC_SRSR_CDOG_RST_M7_SHIFT               (14U)
/*! CDOG_RST_M7
 *  0b0..Reset is not a result of the mentioned case.
 *  0b1..Reset is a result of the mentioned case.
 */
#define SRC_SRSR_CDOG_RST_M7(x)                  (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_CDOG_RST_M7_SHIFT)) & SRC_SRSR_CDOG_RST_M7_MASK)

#define SRC_SRSR_IPP_RESET_B_M4_MASK             (0x10000U)
#define SRC_SRSR_IPP_RESET_B_M4_SHIFT            (16U)
/*! IPP_RESET_B_M4
 *  0b0..Reset is not a result of ipp_reset_b pin.
 *  0b1..Reset is a result of ipp_reset_b pin.
 */
#define SRC_SRSR_IPP_RESET_B_M4(x)               (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_IPP_RESET_B_M4_SHIFT)) & SRC_SRSR_IPP_RESET_B_M4_MASK)

#define SRC_SRSR_M4_REQUEST_M4_MASK              (0x20000U)
#define SRC_SRSR_M4_REQUEST_M4_SHIFT             (17U)
/*! M4_REQUEST_M4
 *  0b0..Reset is not a result of m4 reset request.
 *  0b1..Reset is a result of m4 reset request.
 */
#define SRC_SRSR_M4_REQUEST_M4(x)                (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_M4_REQUEST_M4_SHIFT)) & SRC_SRSR_M4_REQUEST_M4_MASK)

#define SRC_SRSR_M4_LOCKUP_M4_MASK               (0x40000U)
#define SRC_SRSR_M4_LOCKUP_M4_SHIFT              (18U)
/*! M4_LOCKUP_M4
 *  0b0..Reset is not a result of the mentioned case.
 *  0b1..Reset is a result of the mentioned case.
 */
#define SRC_SRSR_M4_LOCKUP_M4(x)                 (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_M4_LOCKUP_M4_SHIFT)) & SRC_SRSR_M4_LOCKUP_M4_MASK)

#define SRC_SRSR_CSU_RESET_B_M4_MASK             (0x80000U)
#define SRC_SRSR_CSU_RESET_B_M4_SHIFT            (19U)
/*! CSU_RESET_B_M4
 *  0b0..Reset is not a result of the csu_reset_b event.
 *  0b1..Reset is a result of the csu_reset_b event.
 */
#define SRC_SRSR_CSU_RESET_B_M4(x)               (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_CSU_RESET_B_M4_SHIFT)) & SRC_SRSR_CSU_RESET_B_M4_MASK)

#define SRC_SRSR_IPP_USER_RESET_B_M4_MASK        (0x100000U)
#define SRC_SRSR_IPP_USER_RESET_B_M4_SHIFT       (20U)
/*! IPP_USER_RESET_B_M4
 *  0b0..Reset is not a result of the ipp_user_reset_b qualified as COLD reset event.
 *  0b1..Reset is a result of the ipp_user_reset_b qualified as COLD reset event.
 */
#define SRC_SRSR_IPP_USER_RESET_B_M4(x)          (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_IPP_USER_RESET_B_M4_SHIFT)) & SRC_SRSR_IPP_USER_RESET_B_M4_MASK)

#define SRC_SRSR_WDOG_RST_B_M4_MASK              (0x200000U)
#define SRC_SRSR_WDOG_RST_B_M4_SHIFT             (21U)
/*! WDOG_RST_B_M4
 *  0b0..Reset is not a result of the watchdog time-out event.
 *  0b1..Reset is a result of the watchdog time-out event.
 */
#define SRC_SRSR_WDOG_RST_B_M4(x)                (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_WDOG_RST_B_M4_SHIFT)) & SRC_SRSR_WDOG_RST_B_M4_MASK)

#define SRC_SRSR_JTAG_RST_B_M4_MASK              (0x400000U)
#define SRC_SRSR_JTAG_RST_B_M4_SHIFT             (22U)
/*! JTAG_RST_B_M4
 *  0b0..Reset is not a result of HIGH-Z reset from JTAG.
 *  0b1..Reset is a result of HIGH-Z reset from JTAG.
 */
#define SRC_SRSR_JTAG_RST_B_M4(x)                (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_JTAG_RST_B_M4_SHIFT)) & SRC_SRSR_JTAG_RST_B_M4_MASK)

#define SRC_SRSR_JTAG_SW_RST_M4_MASK             (0x800000U)
#define SRC_SRSR_JTAG_SW_RST_M4_SHIFT            (23U)
/*! JTAG_SW_RST_M4
 *  0b0..Reset is not a result of software reset from JTAG.
 *  0b1..Reset is a result of software reset from JTAG.
 */
#define SRC_SRSR_JTAG_SW_RST_M4(x)               (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_JTAG_SW_RST_M4_SHIFT)) & SRC_SRSR_JTAG_SW_RST_M4_MASK)

#define SRC_SRSR_WDOG3_RST_B_M4_MASK             (0x1000000U)
#define SRC_SRSR_WDOG3_RST_B_M4_SHIFT            (24U)
/*! WDOG3_RST_B_M4
 *  0b0..Reset is not a result of the watchdog3 time-out event.
 *  0b1..Reset is a result of the watchdog3 time-out event.
 */
#define SRC_SRSR_WDOG3_RST_B_M4(x)               (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_WDOG3_RST_B_M4_SHIFT)) & SRC_SRSR_WDOG3_RST_B_M4_MASK)

#define SRC_SRSR_WDOG4_RST_B_M4_MASK             (0x2000000U)
#define SRC_SRSR_WDOG4_RST_B_M4_SHIFT            (25U)
/*! WDOG4_RST_B_M4
 *  0b0..Reset is not a result of the watchdog4 time-out event.
 *  0b1..Reset is a result of the watchdog4 time-out event.
 */
#define SRC_SRSR_WDOG4_RST_B_M4(x)               (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_WDOG4_RST_B_M4_SHIFT)) & SRC_SRSR_WDOG4_RST_B_M4_MASK)

#define SRC_SRSR_TEMPSENSE_RST_B_M4_MASK         (0x4000000U)
#define SRC_SRSR_TEMPSENSE_RST_B_M4_SHIFT        (26U)
/*! TEMPSENSE_RST_B_M4
 *  0b0..Reset is not a result of software reset from Temperature Sensor.
 *  0b1..Reset is a result of software reset from Temperature Sensor.
 */
#define SRC_SRSR_TEMPSENSE_RST_B_M4(x)           (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_TEMPSENSE_RST_B_M4_SHIFT)) & SRC_SRSR_TEMPSENSE_RST_B_M4_MASK)

#define SRC_SRSR_M7_REQUEST_M4_MASK              (0x8000000U)
#define SRC_SRSR_M7_REQUEST_M4_SHIFT             (27U)
/*! M7_REQUEST_M4
 *  0b0..Reset is not a result of m7 reset request.
 *  0b1..Reset is a result of m7 reset request.
 */
#define SRC_SRSR_M7_REQUEST_M4(x)                (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_M7_REQUEST_M4_SHIFT)) & SRC_SRSR_M7_REQUEST_M4_MASK)

#define SRC_SRSR_M7_LOCKUP_M4_MASK               (0x10000000U)
#define SRC_SRSR_M7_LOCKUP_M4_SHIFT              (28U)
/*! M7_LOCKUP_M4
 *  0b0..Reset is not a result of the mentioned case.
 *  0b1..Reset is a result of the mentioned case.
 */
#define SRC_SRSR_M7_LOCKUP_M4(x)                 (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_M7_LOCKUP_M4_SHIFT)) & SRC_SRSR_M7_LOCKUP_M4_MASK)

#define SRC_SRSR_OVERVOLT_RST_M4_MASK            (0x20000000U)
#define SRC_SRSR_OVERVOLT_RST_M4_SHIFT           (29U)
/*! OVERVOLT_RST_M4
 *  0b0..Reset is not a result of the mentioned case.
 *  0b1..Reset is a result of the mentioned case.
 */
#define SRC_SRSR_OVERVOLT_RST_M4(x)              (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_OVERVOLT_RST_M4_SHIFT)) & SRC_SRSR_OVERVOLT_RST_M4_MASK)

#define SRC_SRSR_CDOG_RST_M4_MASK                (0x40000000U)
#define SRC_SRSR_CDOG_RST_M4_SHIFT               (30U)
/*! CDOG_RST_M4
 *  0b0..Reset is not a result of the mentioned case.
 *  0b1..Reset is a result of the mentioned case.
 */
#define SRC_SRSR_CDOG_RST_M4(x)                  (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_CDOG_RST_M4_SHIFT)) & SRC_SRSR_CDOG_RST_M4_MASK)
/*! @} */

/*! @name GPR - SRC General Purpose Register */
/*! @{ */

