Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1170/periph/PERI_SRC.h
#define SRC_GPR_GPR_MASK                         (0xFFFFFFFFU)
#define SRC_GPR_GPR_SHIFT                        (0U)
/*! GPR - General Purpose Register. */
#define SRC_GPR_GPR(x)                           (((uint32_t)(((uint32_t)(x)) << SRC_GPR_GPR_SHIFT)) & SRC_GPR_GPR_MASK)
/*! @} */

/*! @name AUTHEN_MEGA - Slice Authentication Register */
/*! @{ */

#define SRC_AUTHEN_MEGA_DOMAIN_MODE_MASK         (0x1U)
#define SRC_AUTHEN_MEGA_DOMAIN_MODE_SHIFT        (0U)
/*! DOMAIN_MODE
 *  0b0..slice hardware reset will NOT be triggered by CPU power mode transition
 *  0b1..slice hardware reset will be triggered by CPU power mode transition. Do not set this bit and SETPOINT_MODE at the same time.
 */
#define SRC_AUTHEN_MEGA_DOMAIN_MODE(x)           (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_MEGA_DOMAIN_MODE_SHIFT)) & SRC_AUTHEN_MEGA_DOMAIN_MODE_MASK)

#define SRC_AUTHEN_MEGA_SETPOINT_MODE_MASK       (0x2U)
#define SRC_AUTHEN_MEGA_SETPOINT_MODE_SHIFT      (1U)
/*! SETPOINT_MODE
 *  0b0..slice hardware reset will NOT be triggered by Setpoint transition
 *  0b1..slice hardware reset will be triggered by Setpoint transition. Do not set this bit and DOMAIN_MODE at the same time.
 */
#define SRC_AUTHEN_MEGA_SETPOINT_MODE(x)         (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_MEGA_SETPOINT_MODE_SHIFT)) & SRC_AUTHEN_MEGA_SETPOINT_MODE_MASK)

#define SRC_AUTHEN_MEGA_LOCK_MODE_MASK           (0x80U)
#define SRC_AUTHEN_MEGA_LOCK_MODE_SHIFT          (7U)
/*! LOCK_MODE - Domain/Setpoint mode lock */
#define SRC_AUTHEN_MEGA_LOCK_MODE(x)             (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_MEGA_LOCK_MODE_SHIFT)) & SRC_AUTHEN_MEGA_LOCK_MODE_MASK)

#define SRC_AUTHEN_MEGA_ASSIGN_LIST_MASK         (0xF00U)
#define SRC_AUTHEN_MEGA_ASSIGN_LIST_SHIFT        (8U)
#define SRC_AUTHEN_MEGA_ASSIGN_LIST(x)           (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_MEGA_ASSIGN_LIST_SHIFT)) & SRC_AUTHEN_MEGA_ASSIGN_LIST_MASK)

#define SRC_AUTHEN_MEGA_LOCK_ASSIGN_MASK         (0x8000U)
#define SRC_AUTHEN_MEGA_LOCK_ASSIGN_SHIFT        (15U)
/*! LOCK_ASSIGN - Assign list lock */
#define SRC_AUTHEN_MEGA_LOCK_ASSIGN(x)           (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_MEGA_LOCK_ASSIGN_SHIFT)) & SRC_AUTHEN_MEGA_LOCK_ASSIGN_MASK)

#define SRC_AUTHEN_MEGA_WHITE_LIST_MASK          (0xF0000U)
#define SRC_AUTHEN_MEGA_WHITE_LIST_SHIFT         (16U)
/*! WHITE_LIST - Domain ID white list */
#define SRC_AUTHEN_MEGA_WHITE_LIST(x)            (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_MEGA_WHITE_LIST_SHIFT)) & SRC_AUTHEN_MEGA_WHITE_LIST_MASK)

#define SRC_AUTHEN_MEGA_LOCK_LIST_MASK           (0x800000U)
#define SRC_AUTHEN_MEGA_LOCK_LIST_SHIFT          (23U)
/*! LOCK_LIST - White list lock */
#define SRC_AUTHEN_MEGA_LOCK_LIST(x)             (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_MEGA_LOCK_LIST_SHIFT)) & SRC_AUTHEN_MEGA_LOCK_LIST_MASK)

#define SRC_AUTHEN_MEGA_USER_MASK                (0x1000000U)
#define SRC_AUTHEN_MEGA_USER_SHIFT               (24U)
/*! USER - Allow user mode access */
#define SRC_AUTHEN_MEGA_USER(x)                  (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_MEGA_USER_SHIFT)) & SRC_AUTHEN_MEGA_USER_MASK)

#define SRC_AUTHEN_MEGA_NONSECURE_MASK           (0x2000000U)
#define SRC_AUTHEN_MEGA_NONSECURE_SHIFT          (25U)
/*! NONSECURE - Allow non-secure mode access */
#define SRC_AUTHEN_MEGA_NONSECURE(x)             (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_MEGA_NONSECURE_SHIFT)) & SRC_AUTHEN_MEGA_NONSECURE_MASK)

#define SRC_AUTHEN_MEGA_LOCK_SETTING_MASK        (0x80000000U)
#define SRC_AUTHEN_MEGA_LOCK_SETTING_SHIFT       (31U)
/*! LOCK_SETTING - Lock NONSECURE and USER */
#define SRC_AUTHEN_MEGA_LOCK_SETTING(x)          (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_MEGA_LOCK_SETTING_SHIFT)) & SRC_AUTHEN_MEGA_LOCK_SETTING_MASK)
/*! @} */

/*! @name CTRL_MEGA - Slice Control Register */
/*! @{ */

#define SRC_CTRL_MEGA_SW_RESET_MASK              (0x1U)
#define SRC_CTRL_MEGA_SW_RESET_SHIFT             (0U)
/*! SW_RESET
 *  0b0..do not assert slice software reset
 *  0b1..assert slice software reset
 */
#define SRC_CTRL_MEGA_SW_RESET(x)                (((uint32_t)(((uint32_t)(x)) << SRC_CTRL_MEGA_SW_RESET_SHIFT)) & SRC_CTRL_MEGA_SW_RESET_MASK)
/*! @} */

/*! @name SETPOINT_MEGA - Slice Setpoint Config Register */
/*! @{ */

#define SRC_SETPOINT_MEGA_SETPOINT0_MASK         (0x1U)
#define SRC_SETPOINT_MEGA_SETPOINT0_SHIFT        (0U)
/*! SETPOINT0 - SETPOINT0
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_MEGA_SETPOINT0(x)           (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_MEGA_SETPOINT0_SHIFT)) & SRC_SETPOINT_MEGA_SETPOINT0_MASK)

#define SRC_SETPOINT_MEGA_SETPOINT1_MASK         (0x2U)
#define SRC_SETPOINT_MEGA_SETPOINT1_SHIFT        (1U)
/*! SETPOINT1 - SETPOINT1
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_MEGA_SETPOINT1(x)           (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_MEGA_SETPOINT1_SHIFT)) & SRC_SETPOINT_MEGA_SETPOINT1_MASK)

#define SRC_SETPOINT_MEGA_SETPOINT2_MASK         (0x4U)
#define SRC_SETPOINT_MEGA_SETPOINT2_SHIFT        (2U)
/*! SETPOINT2 - SETPOINT2
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_MEGA_SETPOINT2(x)           (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_MEGA_SETPOINT2_SHIFT)) & SRC_SETPOINT_MEGA_SETPOINT2_MASK)

#define SRC_SETPOINT_MEGA_SETPOINT3_MASK         (0x8U)
#define SRC_SETPOINT_MEGA_SETPOINT3_SHIFT        (3U)
/*! SETPOINT3 - SETPOINT3
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_MEGA_SETPOINT3(x)           (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_MEGA_SETPOINT3_SHIFT)) & SRC_SETPOINT_MEGA_SETPOINT3_MASK)

#define SRC_SETPOINT_MEGA_SETPOINT4_MASK         (0x10U)
#define SRC_SETPOINT_MEGA_SETPOINT4_SHIFT        (4U)
/*! SETPOINT4 - SETPOINT4
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_MEGA_SETPOINT4(x)           (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_MEGA_SETPOINT4_SHIFT)) & SRC_SETPOINT_MEGA_SETPOINT4_MASK)

#define SRC_SETPOINT_MEGA_SETPOINT5_MASK         (0x20U)
#define SRC_SETPOINT_MEGA_SETPOINT5_SHIFT        (5U)
/*! SETPOINT5 - SETPOINT5
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_MEGA_SETPOINT5(x)           (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_MEGA_SETPOINT5_SHIFT)) & SRC_SETPOINT_MEGA_SETPOINT5_MASK)

#define SRC_SETPOINT_MEGA_SETPOINT6_MASK         (0x40U)
#define SRC_SETPOINT_MEGA_SETPOINT6_SHIFT        (6U)
/*! SETPOINT6 - SETPOINT6
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_MEGA_SETPOINT6(x)           (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_MEGA_SETPOINT6_SHIFT)) & SRC_SETPOINT_MEGA_SETPOINT6_MASK)

#define SRC_SETPOINT_MEGA_SETPOINT7_MASK         (0x80U)
#define SRC_SETPOINT_MEGA_SETPOINT7_SHIFT        (7U)
/*! SETPOINT7 - SETPOINT7
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_MEGA_SETPOINT7(x)           (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_MEGA_SETPOINT7_SHIFT)) & SRC_SETPOINT_MEGA_SETPOINT7_MASK)

#define SRC_SETPOINT_MEGA_SETPOINT8_MASK         (0x100U)
#define SRC_SETPOINT_MEGA_SETPOINT8_SHIFT        (8U)
/*! SETPOINT8 - SETPOINT8
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_MEGA_SETPOINT8(x)           (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_MEGA_SETPOINT8_SHIFT)) & SRC_SETPOINT_MEGA_SETPOINT8_MASK)

#define SRC_SETPOINT_MEGA_SETPOINT9_MASK         (0x200U)
#define SRC_SETPOINT_MEGA_SETPOINT9_SHIFT        (9U)
/*! SETPOINT9 - SETPOINT9
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_MEGA_SETPOINT9(x)           (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_MEGA_SETPOINT9_SHIFT)) & SRC_SETPOINT_MEGA_SETPOINT9_MASK)

#define SRC_SETPOINT_MEGA_SETPOINT10_MASK        (0x400U)
#define SRC_SETPOINT_MEGA_SETPOINT10_SHIFT       (10U)
/*! SETPOINT10 - SETPOINT10
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_MEGA_SETPOINT10(x)          (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_MEGA_SETPOINT10_SHIFT)) & SRC_SETPOINT_MEGA_SETPOINT10_MASK)

