Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1170/periph/PERI_SRC.h
#define SRC_SETPOINT_USBPHY1_SETPOINT3_MASK      (0x8U)
#define SRC_SETPOINT_USBPHY1_SETPOINT3_SHIFT     (3U)
/*! SETPOINT3 - SETPOINT3
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_USBPHY1_SETPOINT3(x)        (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_USBPHY1_SETPOINT3_SHIFT)) & SRC_SETPOINT_USBPHY1_SETPOINT3_MASK)

#define SRC_SETPOINT_USBPHY1_SETPOINT4_MASK      (0x10U)
#define SRC_SETPOINT_USBPHY1_SETPOINT4_SHIFT     (4U)
/*! SETPOINT4 - SETPOINT4
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_USBPHY1_SETPOINT4(x)        (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_USBPHY1_SETPOINT4_SHIFT)) & SRC_SETPOINT_USBPHY1_SETPOINT4_MASK)

#define SRC_SETPOINT_USBPHY1_SETPOINT5_MASK      (0x20U)
#define SRC_SETPOINT_USBPHY1_SETPOINT5_SHIFT     (5U)
/*! SETPOINT5 - SETPOINT5
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_USBPHY1_SETPOINT5(x)        (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_USBPHY1_SETPOINT5_SHIFT)) & SRC_SETPOINT_USBPHY1_SETPOINT5_MASK)

#define SRC_SETPOINT_USBPHY1_SETPOINT6_MASK      (0x40U)
#define SRC_SETPOINT_USBPHY1_SETPOINT6_SHIFT     (6U)
/*! SETPOINT6 - SETPOINT6
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_USBPHY1_SETPOINT6(x)        (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_USBPHY1_SETPOINT6_SHIFT)) & SRC_SETPOINT_USBPHY1_SETPOINT6_MASK)

#define SRC_SETPOINT_USBPHY1_SETPOINT7_MASK      (0x80U)
#define SRC_SETPOINT_USBPHY1_SETPOINT7_SHIFT     (7U)
/*! SETPOINT7 - SETPOINT7
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_USBPHY1_SETPOINT7(x)        (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_USBPHY1_SETPOINT7_SHIFT)) & SRC_SETPOINT_USBPHY1_SETPOINT7_MASK)

#define SRC_SETPOINT_USBPHY1_SETPOINT8_MASK      (0x100U)
#define SRC_SETPOINT_USBPHY1_SETPOINT8_SHIFT     (8U)
/*! SETPOINT8 - SETPOINT8
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_USBPHY1_SETPOINT8(x)        (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_USBPHY1_SETPOINT8_SHIFT)) & SRC_SETPOINT_USBPHY1_SETPOINT8_MASK)

#define SRC_SETPOINT_USBPHY1_SETPOINT9_MASK      (0x200U)
#define SRC_SETPOINT_USBPHY1_SETPOINT9_SHIFT     (9U)
/*! SETPOINT9 - SETPOINT9
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_USBPHY1_SETPOINT9(x)        (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_USBPHY1_SETPOINT9_SHIFT)) & SRC_SETPOINT_USBPHY1_SETPOINT9_MASK)

#define SRC_SETPOINT_USBPHY1_SETPOINT10_MASK     (0x400U)
#define SRC_SETPOINT_USBPHY1_SETPOINT10_SHIFT    (10U)
/*! SETPOINT10 - SETPOINT10
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_USBPHY1_SETPOINT10(x)       (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_USBPHY1_SETPOINT10_SHIFT)) & SRC_SETPOINT_USBPHY1_SETPOINT10_MASK)

#define SRC_SETPOINT_USBPHY1_SETPOINT11_MASK     (0x800U)
#define SRC_SETPOINT_USBPHY1_SETPOINT11_SHIFT    (11U)
/*! SETPOINT11 - SETPOINT11
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_USBPHY1_SETPOINT11(x)       (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_USBPHY1_SETPOINT11_SHIFT)) & SRC_SETPOINT_USBPHY1_SETPOINT11_MASK)

#define SRC_SETPOINT_USBPHY1_SETPOINT12_MASK     (0x1000U)
#define SRC_SETPOINT_USBPHY1_SETPOINT12_SHIFT    (12U)
/*! SETPOINT12 - SETPOINT12
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_USBPHY1_SETPOINT12(x)       (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_USBPHY1_SETPOINT12_SHIFT)) & SRC_SETPOINT_USBPHY1_SETPOINT12_MASK)

#define SRC_SETPOINT_USBPHY1_SETPOINT13_MASK     (0x2000U)
#define SRC_SETPOINT_USBPHY1_SETPOINT13_SHIFT    (13U)
/*! SETPOINT13 - SETPOINT13
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_USBPHY1_SETPOINT13(x)       (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_USBPHY1_SETPOINT13_SHIFT)) & SRC_SETPOINT_USBPHY1_SETPOINT13_MASK)

#define SRC_SETPOINT_USBPHY1_SETPOINT14_MASK     (0x4000U)
#define SRC_SETPOINT_USBPHY1_SETPOINT14_SHIFT    (14U)
/*! SETPOINT14 - SETPOINT14
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_USBPHY1_SETPOINT14(x)       (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_USBPHY1_SETPOINT14_SHIFT)) & SRC_SETPOINT_USBPHY1_SETPOINT14_MASK)

#define SRC_SETPOINT_USBPHY1_SETPOINT15_MASK     (0x8000U)
#define SRC_SETPOINT_USBPHY1_SETPOINT15_SHIFT    (15U)
/*! SETPOINT15 - SETPOINT15
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_USBPHY1_SETPOINT15(x)       (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_USBPHY1_SETPOINT15_SHIFT)) & SRC_SETPOINT_USBPHY1_SETPOINT15_MASK)
/*! @} */

/*! @name DOMAIN_USBPHY1 - Slice Domain Config Register */
/*! @{ */

#define SRC_DOMAIN_USBPHY1_CPU0_RUN_MASK         (0x1U)
#define SRC_DOMAIN_USBPHY1_CPU0_RUN_SHIFT        (0U)
/*! CPU0_RUN - CPU mode setting for RUN
 *  0b0..Slice reset will be de-asserted when CPU0 in RUN mode
 *  0b1..Slice reset will be asserted when CPU0 in RUN mode
 */
#define SRC_DOMAIN_USBPHY1_CPU0_RUN(x)           (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_USBPHY1_CPU0_RUN_SHIFT)) & SRC_DOMAIN_USBPHY1_CPU0_RUN_MASK)

#define SRC_DOMAIN_USBPHY1_CPU0_WAIT_MASK        (0x2U)
#define SRC_DOMAIN_USBPHY1_CPU0_WAIT_SHIFT       (1U)
/*! CPU0_WAIT - CPU mode setting for WAIT
 *  0b0..Slice reset will be de-asserted when CPU0 in WAIT mode
 *  0b1..Slice reset will be asserted when CPU0 in WAIT mode
 */
#define SRC_DOMAIN_USBPHY1_CPU0_WAIT(x)          (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_USBPHY1_CPU0_WAIT_SHIFT)) & SRC_DOMAIN_USBPHY1_CPU0_WAIT_MASK)

#define SRC_DOMAIN_USBPHY1_CPU0_STOP_MASK        (0x4U)
#define SRC_DOMAIN_USBPHY1_CPU0_STOP_SHIFT       (2U)
/*! CPU0_STOP - CPU mode setting for STOP
 *  0b0..Slice reset will be de-asserted when CPU0 in STOP mode
 *  0b1..Slice reset will be asserted when CPU0 in STOP mode
 */
#define SRC_DOMAIN_USBPHY1_CPU0_STOP(x)          (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_USBPHY1_CPU0_STOP_SHIFT)) & SRC_DOMAIN_USBPHY1_CPU0_STOP_MASK)

